#include "DxLib.h"
#include "Time.h"

/***********************************************
* 変数の宣言(グローバル変数)
***********************************************/
int gStartTime; //制限時間の開始

/***********************************************
* タイム初期化
***********************************************/
void GameInit(void)
{
	gStartTime = GetNowCount();
}

/***********************************************
* タイムメイン
***********************************************/
void Main(void)
{
	int nowTime = GetNowCount();
	
}
